In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns

import wrangle as w
import model as m
import prepare as p
import preprocess as pp

from sklearn.linear_model import LinearRegression, LassoLars, TweedieRegressor
from sklearn.preprocessing import PolynomialFeatures

from sklearn.ensemble import RandomForestRegressor
from xgboost import XGBRegressor

In [2]:
df = w.clean_zillow()

df.head()

found data

   bedrooms  bathrooms  square_ft  tax_value  year  tax_amount       county
3         0        0.0       1535       2108  1953      174.21  Los Angeles
4         4        2.0       3633     296425  2005     6941.39  Los Angeles
6         3        4.0       1620     847770  2011    10244.94  Los Angeles
7         3        2.0       2077     646760  1926     7924.68  Los Angeles
8         0        0.0       1535    6730242  1953    80348.13  Los Angeles

In [3]:
df = df.drop(columns = ['tax_amount'])

In [4]:
train, val, test = p.split_data(df)

train.shape, val.shape, test.shape

((1503871, 6), (322258, 6), (322259, 6))

In [5]:
train, val = pp.dummies(train, val)

train.head()

,bedrooms,bathrooms,square_ft,tax_value,year,county_Los Angeles,county_Orange,county_Ventura
1911171,2,1.0,1180,288951,1946,1,0,0
818602,4,3.0,2594,266330,1973,0,0,1
1795717,4,2.5,2454,325747,2009,0,1,0
1973528,4,1.0,1700,40740,1911,1,0,0
1139959,4,2.5,2598,369055,1964,0,1,0

In [6]:
X_train, y_train = pp.xy_split(train)

X_train.head()

,bedrooms,bathrooms,square_ft,year,county_Los Angeles,county_Orange,county_Ventura
1911171,2,1.0,1180,1946,1,0,0
818602,4,3.0,2594,1973,0,0,1
1795717,4,2.5,2454,2009,0,1,0
1973528,4,1.0,1700,1911,1,0,0
1139959,4,2.5,2598,1964,0,1,0

In [8]:
X_train, y = pp.xy_split(val)

X_train.head()

,bedrooms,bathrooms,square_ft,year,county_Los Angeles,county_Orange,county_Ventura
439008,4,2.0,1586,1966,0,1,0
933814,3,2.0,1658,1977,0,1,0
1334468,3,3.0,2916,1990,0,1,0
863366,4,3.0,2474,1957,1,0,0
852403,3,1.0,1101,1951,1,0,0

In [9]:
train, val, test = scale_data(train, val, test, X_train)
train.head()

NameError: name 'scale_data' is not defined